//登录验证
#include<stdio.h>

int main(){
    int jskh;//借书卡号
    char yhxm[20];//用户姓名,定义一个可容纳20个字符的字符串数组
    printf("***************************************************\n");
    printf("*****************欢迎登录图书管理系统***************\n");
    printf("***************************************************\n");
    printf("~~~~~~~~~~\t\t\t\t~~~~~~~~~~\n");
    printf("请输入借书卡号：");
    scanf("%d/n", &jskh);
    printf("请输入用户姓名：");
    scanf("%s/n", yhxm);
    printf("登陆成功,%s!你的卡号是：%d",yhxm,jskh);
    return 0;
}